import { IMapPoint, ICitiesCoords } from '@/models/map'
export const GLOBAL_FILIALS_DATA: IMapPoint[] = [
    {
        coords: [55.645943569081666, 37.67312399999999],
        info: {
            company: 'Транс Стартер МСК &laquo;Каширка&raquo;',
            address: 'г.Москва, Каширское ш. д.41',
            phones: ['8-495-744-37-75'],
            website: 'msk.tstarter.ru',
            city: 'Москва',
        },
    },
    {
        coords: [55.64204706910142, 37.82867649999988],
        info: {
            company: '&laquo;Транс Стартер МСК&raquo;',
            address: 'Московская область, г.Дзержинский, ул.Энергетиков 18А',
            phones: ['8-495-748-97-74 (Многоканальный номер)'],
            website: 'msk.tstarter.ru',
            city: 'Дзержинский',
        },
    },
    {
        coords: [54.73466856993723, 20.513289999999976],
        info: {
            company: '&laquoТранс Стартер КЛД&raquo',
            address: 'г.Калининград, ул.Первомайская, д.17',
            phones: ['8-4012-525-400'],
            website: 'kld.tstarter.ru',
            city: 'Калининград',
        },
    },
    {
        coords: [54.6902360699703, 20.53148999999996],
        info: {
            company: '&laquoТранс Стартер КЛД&raquo',
            address: 'г.Калининград, ул. Дзержинского, 59б',
            phones: ['8-4012-520-890'],
            website: 'kld.tstarter.ru',
            city: 'Калининград',
        },
    },
    {
        coords: [56.81833556789966, 60.63350600000002],
        info: {
            company: '&laquoТранс Стартер ЕКБ&raquo',
            address: 'г.Екатеринбург, ул.Ткачей, 14-А',
            phones: ['8-343-219-88-66'],
            website: 'ekb.tstarter.ru',
            city: 'Екатеринбург',
        },
    },
    {
        coords: [45.063578574591006, 38.972447499999966],
        info: {
            company: '&laquoТранс Стартер КРД&raquo',
            address: 'г.Краснодар, ул.Дальняя, д.2',
            phones: ['8-861-290-09-19'],
            website: 'krd.tstarter.ru',
            city: 'Краснодар',
        },
    },
    {
        coords: [43.21356007453611, 76.8984115],
        info: {
            company: '&laquoТранс Стартер КЗ&raquo',
            address: 'г.Алматы, пр.Гагарина, 236-Б',
            phones: ['8-727-346-82-08'],
            website: 'tstarter.kz',
            city: 'Алматы',
        },
    },
    {
        coords: [50.48895707299117, 30.482164499999907],
        info: {
            company: '&laquoТранс Стартер UA&raquo',
            address: 'г.Киев, Московский пр., д.15',
            phones: ['+380 44 222 67-85'],
            website: '',
            city: 'Киев',
        },
    },
    {
        coords: [59.60026806460948, 60.55263950000002],
        info: {
            company: '&laquoТранс Стартер Серов&raquo',
            address: 'г.Серов, ул.Кирова, 49/10Б',
            phones: ['8 (34385) 9-81-03'],
            website: 'ekb.tstarter.ru',
            city: 'Серов',
        },
    },
    {
        coords: [56.910173, 60.798203],
        info: {
            company: '&laquoТранс Стартер Березовский&raquo',
            address: 'г.Березовский, Березовский тракт, 2Г',
            phones: ['8 (343) 268-11-90'],
            website: 'ekb.tstarter.ru',
            city: 'Березовский',
        },
    },
]

export const GLOBAL_FRANCHISE_DATA: IMapPoint[] = [
    {
        coords: [46.36051457446036, 48.09006899999998],
        info: {
            company: '&laquoТранс Стартер Астрахань&raquo',
            address: 'г.Астрахань, ул.Славянская, д.1',
            phones: ['8-906-456-05-26', '8-937-509-79-82'],
            website: 'ast.tstarter.ru',
            city: 'Астрахань',
        },
    },
    {
        coords: [64.55915155729815, 40.57601199999998],
        info: {
            company: '&laquoТранс Стартер Архангельск&raquo',
            address: 'г.Архангельск, Окружное ш., д.11, стр.2',
            phones: ['8 (8182) 4-777-51', '8 (8182) 4-777-56', '8 (8182) 4-777-62'],
            website: 'arh.tstarter.ru',
            city: 'Архангельск',
        },
    },
    {
        coords: [55.0707160696502, 73.30726149999994],
        info: {
            company: '&laquoТранс Стартер Омск&raquo',
            address: 'г.Омск, Красноярский тракт, 119/1',
            phones: ['8 (3812) 59-11-99', '8 (908) 116-77-77'],
            website: 'omsk.tstarter,ru',
            city: 'Омск',
        },
    },
    {
        coords: [45.02223957458696, 39.04732199999996],
        info: {
            company: '&laquoТранс Стартер Краснодар&raquo',
            address: 'г.Краснодар, ул.Сормовская д.1',
            phones: ['8 (961) 853-39-94'],
            website: 'krd.tstarter.ru',
            city: 'Краснодар',
        },
    },
    {
        coords: [51.555569072363866, 46.00297749999999],
        info: {
            company: '&laquoТранс Стартер Саратов&raquo',
            address: 'г.Саратов, Мурманский проезд, д.1А',
            phones: ['8 (8452) 49-49-26', '8 (953) 634-43-80'],
            website: 'saratov.tstarter.ru',
            city: 'Саратов',
        },
    },
    {
        coords: [58.565420065904114, 49.608258],
        info: {
            company: '&laquoТранс Стартер Киров&raquo',
            address: 'г. Киров, ул.Производственная, 39/1',
            phones: ['8 (8332) 78-73-71', '8 909 135-55-33'],
            website: 'kirov.tstarter.ru',
            city: 'Киров',
        },
    },
]

export const citiesCoords: ICitiesCoords = {
    Калининград: {
        center: [54.704528907978, 20.473791500000015],
        zoom: 12,
    },
    Москва: {
        center: [55.584222181163646, 37.38552449999999],
        zoom: 9,
    },
    Астрахань: {
        center: [46.34647366903166, 48.03767646826173],
        zoom: 12,
    },
    Архангельск: {
        center: [64.56272891354934, 40.55266499999995],
        zoom: 11,
    },
    Краснодар: {
        center: [45.06165537048585, 38.962197500000016],
        zoom: 12,
    },
    'Санкт-Петербург': {
        center: [59.91807704072416, 30.304899499999895],
        zoom: 10,
    },
    Екатеринбург: {
        center: [56.78875104810377, 60.60157099999987],
        zoom: 10,
    },
    Оренбург: {
        center: [51.7933427886505, 55.197472000000005],
        zoom: 11,
    },
    Пермь: {
        center: [58.02283310604378, 56.2294204999999],
        zoom: 11,
    },
    Алматы: {
        center: [43.221309640757674, 76.95543649999995],
        zoom: 11,
    },
    Киев: {
        center: [50.40239488870545, 30.532734499999968],
        zoom: 11,
    },
    Новосибирск: {
        center: [55.000665013597725, 82.95603900000002],
        zoom: 10,
    },
    Березовский: {
        center: [56.89659453694885, 60.75918848274228],
        zoom: 13,
    },
    Серов: {
        center: [59.60633329588266, 60.580495999999975],
        zoom: 12,
    },
    Омск: {
        center: [55.070792258316466, 73.34821759765622],
        zoom: 12,
    },
    Саратов: {
        center: [51.53920339085138, 46.007006499999896],
        zoom: 12,
    },
    Киров: {
        center: [58.565420065904114, 49.608258],
        zoom: 15,
    },
    Дзержинский: {
        center: [55.584222181163646, 37.38552449999999],
        zoom: 9,
    },
}
