const FilialCities = ['Moscow', 'Kaliningrad', 'Ekaterinburg', 'Krasnodar', 'Almaty', 'kiev']
const franchiseCitites = ['astrachan', 'archanglesk', 'omsk', 'Krasnodar', 'saratov']
// prettier-ignore
const filialData = [
    [
        [55.645943569081666,37.67312399999999],
        'г. Москва Каширское ш. д.41',
        '8-495-744-37-75',
    ],
    [
        [55.64204706910142,37.82867649999988],
        'Московская область, г.Дзержинский, ул.Энергетиков 18А',
        ' 8-495-748-97-74',
    ],
    [
        [54.73466856993723,20.513289999999976],
        'г. Калининград, ул.Первомайская, д.17',
        '8-4012-525-400',
    ],
    [
        [56.81833556789966,60.63350600000002],
        'г. Екатеринбург, ул.Ткачей, 14-А',
        '8-343-219-88-66',
    ],
    [
        [45.063578574591006,38.972447499999966],
        'г. Краснодар, ул. Дальняя, 2',
        '8-861-290-09-19',
    ],
    [
        [43.21356007453611,76.8984115],
        'г. Алматы пр.Гагарина, 236-Б',
        '8-727-346-82-08',
    ],
    [
        [50.48895707299117,30.482164499999907],
        'г. Киев Московский пр. д.15',
        '+380 44 222 67-85',
    ],
    [
        [59.60026806460948,60.55263950000002],
        'г. Серов ул. Кирова, 49/10Б',
        '8 (34385) 9-81-03',
    ],
    [
        [56.898849067774634,60.767417499999965],
        'г. Березовский, Березовский тракт, 2г',
        '8 (343) 268-11-90',
    ],
]

// prettier-ignore
const franchiseData = [
    [
        [46.36051457446036,48.09006899999998],
        'г. Астрахань, ул. Славянская, д.1',
        ['8-906-456-05-26', '8-937-509-79-82'],
    ],
    [
        [64.55915155729815,40.57601199999998],
        'г. Архангельск, Окружное ш., д.11, стр.2',
        ['8(8182) 4-777-51', '8 (8182) 4-777-56', '8 (8182) 4-777-62'],
    ],
    [
        [55.0707160696502,73.30726149999994],
        'г. Омск, Красноярский тракт 119/1',
        ['8 (3812) 59-11-99', '8 (908) 116-77-77'],
    ],
    [
        [45.02223957458696,39.04732199999996],
        'г. Краснодар,ул. Сормовская 1',
        '8(961)853-39-94',
    ],
    [
        [51.555569072363866,46.00297749999999],
        'г. Саратов, Мурманский проезд, д 1А',
        ["8(8452) 49-49-26", "8(953) 634-43-80"]
    ],
]
